Revit 2024 API
DeleteWorksetOption Enumeration
 This class defines an enumerative type used to specify the option to delete a workset.
 This enumerative type corresponds to the possible options to delete a workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Since: 2022.1
Syntax
C#
public enum DeleteWorksetOption
Visual Basic
Public Enumeration DeleteWorksetOption
Visual C++
public enum class DeleteWorksetOption
Members
Member name | Description
MoveElementsToWorkset |  Delete a workset, while moving the elements from the deleted workset to another workset.
DeleteAllElements |  Delete a workset together with all the elements in this workset.
See Also
Autodesk.Revit.DB Namespace